#### AirHeatingCoilType Enumeration

---

|  |
| --- |
| See Also |

The type of air heating coil.

**Namespace:**   Autodesk.Revit.DB.Mechanical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2020

# Syntax

| C# |
| --- |
| ``` public enum AirHeatingCoilType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration AirHeatingCoilType ``` |

| Visual C++ |
| --- |
| ``` public enum class AirHeatingCoilType ``` |

# Members

| Member name | Description |
| --- | --- |
| None |  |
| ElectricResistance |  |
| Furnace |  |
| HotWater |  |

# See Also

Autodesk.Revit.DB.Mechanical Namespace